export const statusInfo = {
  nonPupilRegP: `отменен в связи с техническими неполадками с вашей стороны. По правилам школы, он будет списан у вас с баланса.`,

  nonPupilIntroP: `отменен в связи с техническими неполадками с вашей стороны. Урок возвращен вам на баланс. С вами свяжется мой коллега по поводу его переназначения.`,

  nonPupilT: `отменен в связи с техническими неполадками со стороны ученика. За урок вам начислена компенсация.
Ученику предоставлены все необходимые рекомендации, чтобы избежать неполадок с его стороны на будущих уроках.`,

  nonTutorRegP: `отменен в связи с техническими неполадками со стороны преподавателя. Урок возвращен вам на баланс. В качестве извинения, я начислил вам бонусный урок.
Преподавателю предоставлены все необходимые рекомендации, чтобы избежать неполадок с его стороны на будущих уроках.`,

  nonTutorRegT: `отменен в связи с техническими неполадками с вашей стороны. По правилам школы, за урок полагается штраф в размере ставки урока.`,

  nonTutorIntroP: `отменен в связи с техническими неполадками со стороны преподавателя. Урок возвращен вам на баланс. С вами свяжется мой коллега по поводу его переназначения.
Преподавателю предоставлены все необходимые рекомендации, чтобы избежать неполадок с его стороны на будущих уроках.`,

  nonTutorIntroT: `отменен в связи с техническими неполадками с вашей стороны. Штраф за данный урок не полагается.`,

  cancelNotCauseP: `отменен, поскольку не удалось установить причину неполадки. По правилам школы, урок возвращен вам на баланс.`,

  cancelNotCauseT: `отменен, поскольку не удалось установить причину неполадки. По правилам школы, оплата за урок не полагается.`,

  cancelBothP: `отменен в связи с техническими неполадками как с вашей стороны, так и со стороны преподавателя. По правилам школы, урок вернется вам на баланс.
Преподавателю предоставлены все необходимые рекомендации, чтобы избежать неполадок с его стороны на будущих уроках.`,

  cancelBothT: `отменен в связи с техническими неполадками как с вашей стороны, так и со стороны ученика. По правилам школы, оплата за урок не полагается.
Ученику предоставлены все необходимые рекомендации, чтобы избежать неполадок с его стороны на будущих уроках.`,

  cancelBugP: `отменен в связи с техническими неполадками со стороны платформы. Урок возвращен вам на баланс. В качестве извинения, я начислил вам бонусный урок.`,

  cancelBugT: `отменен в связи с техническими неполадками со стороны платформы. За урок вам начислена компенсация.`,

  finishP: `по правилам школы считается проведенным, поскольку прошло больше половины урока.`
};

export const statusInfoTutor = {
  nonPupilT: `отменен в связи с техническими неполадками со стороны ученика. За урок вам начислена компенсация.
Ученику предоставлены все необходимые рекомендации, чтобы избежать неполадок с его стороны на будущих уроках.`,
  nonTutorRegT: `отменен в связи с техническими неполадками с вашей стороны. По правилам школы, за урок полагается штраф в размере ставки урока.`,
  nonTutorIntroT: `отменен в связи с техническими неполадками с вашей стороны. Штраф за данный урок не полагается.`,
  cancelNotCauseT: `отменен, поскольку не удалось установить причину неполадки. По правилам школы, оплата за урок не полагается.`,
  cancelBothT: `отменен в связи с техническими неполадками как с вашей стороны, так и со стороны ученика. По правилам школы, оплата за урок не полагается.
Ученику предоставлены все необходимые рекомендации, чтобы избежать неполадок с его стороны на будущих уроках.`,
  cancelBugT: `отменен в связи с техническими неполадками со стороны платформы. За урок вам начислена компенсация.`
};